package app

import (
	"fmt"
	"strings"
	"testing"
)

var con = `好的恐怖片从不是靠一惊一乍式的视觉冲击。

而是让你像中毒一样。

由体内产生出一种恶寒，打心里觉得这件事恐怖。

尤其是......

那种可以在现实中发生的，甚至发生在你身边的——

隐形人


金球奖+艾美奖双料加身的“使女”伊丽莎白·莫斯，在《隐形人》中被虐的很惨。

凌乱的头发，惨白粗糙的皮肤，浓重的黑眼圈......

她到底经历了什么才会变成这个样子？


深夜。

塞西莉亚（伊丽莎白·莫斯 饰）瞪着闹钟上的时间，等待着某一刻的到来。

然后悄悄起身，从床下拿出一瓶安定。

蹑手蹑脚地离开卧室，临走前还不放心的叫了一下老公的名字，确定他是否真的熟睡。

离开卧室之后。

还要用手机监视丈夫，拿起早就准备好的物品快速离开。



跑到路边，这时妹妹的车正好缓缓驶来。

塞西莉亚上车就催促妹妹立刻开车。

慌乱之中那瓶安定则被掉落在了路边。



可以看出，这次逃跑她筹划了很久。

从给丈夫的水里下药，到拿起早就收拾好的东西，再到给妹妹打电话让她来接自己。

一切都经过了周密的计划。

塞西莉亚为什么如此恐惧，而且精心设计好这次逃跑呢？

有个细节大宝贝们一定要注意。

塞西莉亚刚出门时，狗追了出来。

她看到之后，立刻给狗把电颈圈摘了下来，他的丈夫给狗带这么残忍的东西。

此时，我们可以大胆地猜测一下。

他的丈夫阿德里安难道是一个变态虐待狂？



从后面的故事我们可以看出。

阿德里安是个科技天才，在光学领域颇有建树。

但在性格上却存在着严重的问题。

他有着极强的控制欲。

身边所有人都要听他的指挥，作为妻子的塞西莉亚甚至吃什么穿什么都要被他控制。

长时间的高压统治早就让塞西莉亚变得犹如惊弓之鸟一般。

即使在逃出阿德里安的魔掌之后，她始终不敢走出屋子，总觉得他在暗处监视着自己。



但是让她没想到的是。

噩梦在她逃离之后没几天就结束了。

有一天妹妹过来告诉他，阿德里安在酒店自杀身亡。



不仅如此。

在他的遗嘱中，塞西莉亚可以分期得到一笔500万美元的遗产。

而负责遗产分配的律师，就是阿德里安的哥哥汤姆。



眼看着生活即将重新开始。

塞西莉亚脸上第一次有了笑容。



但是......

她却总是感觉阿德里安一直站在黑暗中监视着她。



晚上，塞西莉亚已经进入了深度睡眠。

身上的被子却被人缓缓地拉了下去。



塞西莉亚想去捡起被子，却突然发现被子上出现了一个人的脚印在慢慢地靠近她。

难道阿德里安真的是假死？



某天塞西莉亚在洗手间看到了自己当初丢在半路上的安定。



这让她更加确信，阿德里安根本就没有死。

而是一直在自己的身边监视着自己。

但是她的话，却让所有人都不信。

他发现了一种可以隐身的方法

我知道他可以让自己隐身





这些话说出来之后。

不仅是阿德里安的哥哥汤姆，就连站在自己这一边的妹夫詹姆斯都不信。

他们都觉得塞西莉亚是因为长期的精神紧绷导致神经错乱，或者长期服用安定导致自己的精神出现了问题。

这时，她的身边也出现了各种奇奇怪怪的事儿。

先是妹妹收到了她早晨发的一封邮件，里面是各种辱骂妹妹的话，导致姐妹俩关系差点决裂。



然后又是她精心准备好的面试作品，在准备给应聘者看的时候突然不翼而飞。

只有塞西莉亚自己知道。

阿德里安绝对就在自己身边监视着自己。

某天晚上，她打了阿德里安的电话。

却突然听到，阁楼上传来了电话的震动声。



塞西莉亚爬上阁楼。

果然在那里发现了阿德里安的手机，里面还有她睡熟时的照片。

就在她被恐惧压的喘不过气的时候。

手机上突然传来一条短信：

surprise



果然！

阿德里安真的是装死，他一直都在周围监视着自己！

当塞西莉亚从阁楼上下去的时候，她突然预感到阁楼口似乎有人。

于是把旁边的油漆桶倒了下去。

突然眼前就出现了一个人的轮廓。



塞西莉亚直接就被吓傻了，调整好情绪之后她立刻追了出去。

但阿德里安早就把油漆清洗干净。

站在暗处对着塞西莉亚一顿疯狂殴打。



而且阿德里安的报复远没有结束。

先是在大庭广众之下杀了塞西莉亚的妹妹然后嫁祸给她，转而又把目标放在了她的侄女身上。



在百分百确定了阿德里安活着之后。

塞西莉亚也开始了自己的反击。

她发现阿德里安真的做出了能让人隐身的衣服。



于是她打起精神，准备用自己的方法还自己一个清白，并让自己彻底的解脱。

关于塞西莉亚的反击，我还是不剧透的好。

把最爽快的部分留给你们自己去看吧。

必须承认。

《隐形人》是一部质量超高的惊悚恐怖片。

片中的恐惧感拥有超强的压迫性。

那种看不见的恐惧透过屏幕传递到每个人的心里。

片中大量的第三人视角更是把观众带进了故事中，让我们成为“阿德里安”,用一种上帝视角审视着塞西莉亚,另一边,导演又很顽皮的用塞西莉亚的视角让我们成为受害人,成为被监视者,让我们凝视着空旷的门道,任由恐惧感慢慢侵蚀过来,隐形人的恐惧,来源于我们对于未知的紧张感,而电影另一层的恐惧,相信你们也都能够看出来,家暴,阿德里安超强的控制欲让妻子塞西莉亚根本无法呼吸,后者也提到过,她稍有反抗就会被阿德里安殴打,整日活在恐惧之下,但塞西莉亚没有懦弱的臣服,而且做好了精心的准备,在一个恰当的时机反击,电影最后的结局,我可以剧透给你们,塞西莉亚带着胜利者的微笑走出了阿德里安的家,我不想把它引到现实生活中,但如果你在现实生活中收到过伤害,那就要学会,`

func TestApp_SpitCount(t *testing.T) {
	a := App{}

	result := strings.FieldsFunc(con, func(c rune) bool {

		for _, r := range spitRune {
			if c == r {
				return true
			}
		}
		return false
	})

	var res []string
	for _, s := range result {
		if len(strings.TrimSpace(s)) > 0 {
			res = append(res, s)
		}
	}

	arr := a.SpitCount(strings.Join(res,","))
	fmt.Println(len(arr))

	for _, a := range arr {
		fmt.Println(a)
		fmt.Println()
	}

}
